Tekla Open API Reference for Tekla Structures 2025
Reinforcement.RebarGeometryOptionEnum Enumeration
 Options for the function GetRebarGeometries.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[FlagsAttribute]
public enum RebarGeometryOptionEnum
<FlagsAttribute>
Public Enumeration RebarGeometryOptionEnum
Members
Member name | Value | Description
NONE | 0 |  No hooks or clash avoidance or length adjustment.
HOOKS | 1 |  Hooks.
AVOID_CLASH | 2 |  In case rebar polygon clashes with itself, physical points are moved to avoid clashing.
LENGTH_ADJUSTMENTS | 4 |  Length adjustments
See Also
Reference
Tekla.Structures.Model Namespace